### 21/08

In [2]:
import pandas as pd

series always have one dimensional deta

In [3]:
## important library which help you work with data

In [4]:
d=pd.Series()

In [5]:

d

Series([], dtype: object)

In [6]:
print(type(d))

<class 'pandas.core.series.Series'>

In [7]:
d=pd.Series(17)

In [8]:
d

0    17
dtype: int64

In [9]:
t=(12,11,16,20)    #..creating series using tuple
d=pd.Series(t)
d

0    12
1    11
2    16
3    20
dtype: int64

In [10]:
p=pd.Series([14,16,17,18,19])    #...creating series using list
p

0    14
1    16
2    17
3    18
4    19
dtype: int64

In [11]:
## creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [12]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [13]:
s2=pd.Series(arr2)      ### array is two dimesional....pandas with series cant allow

ValueError: Data must be 1-dimensional, got ndarray of shape (3, 2) instead

In [12]:
d

0    12
1    11
2    16
3    20
dtype: int64

In [13]:
d={"a":2,"b":20,"c":12,"d":10}    ##creating serries with dictionary

In [14]:
d.values()

dict_values([2, 20, 12, 10])

In [15]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [16]:
d.items()

dict_items([('a', 2), ('b', 20), ('c', 12), ('d', 10)])

In [17]:
d["a"]

2

In [18]:
p1=pd.Series(d)

In [19]:
p1

a     2
b    20
c    12
d    10
dtype: int64

In [20]:
p1[0]

C:\Users\hp\AppData\Local\Temp\ipykernel_6220\1178487653.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  p1[0]

2

In [21]:
p1["a"]

2

In [22]:
import pandas as np

In [23]:
p2=np.Series(arr_2)

NameError: name 'arr_2' is not defined

In [24]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d[:-8:2]

0     1
2     3
4    47
6     7
dtype: int64

In [25]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [26]:
d[10]

78

In [14]:
d[0:10:-1]

Series([], dtype: int64)

In [29]:
d[[4,5,3,6]] ## multiple index

4    47
5    98
3     5
6     7
dtype: int64

In [30]:
d[4]=34  ## changing the element

In [31]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [32]:
d[[4,5,3,6]]

4    34
5    98
3     5
6     7
dtype: int64

In [33]:
d[6:10]=[100,200,300,400]

In [34]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [35]:
arr3=np.array([1,2,4,6])
s=pd.Series(arr3,index=['one','Two','Three','Four'])   
s

one      1
Two      2
Three    4
Four     6
dtype: Int64

In [36]:
arr4=np.array([1,2,4,6])
s1=pd.Series(arr4)   
s1

0    1
1    2
2    4
3    6
dtype: Int64

In [37]:
print(s)

one      1
Two      2
Three    4
Four     6
dtype: Int64

##  Data frames

In [38]:
import pandas as pd

In [39]:
##empty DataFrame
d=pd.DataFrame()

In [40]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [41]:
d

Empty DataFrame
Columns: []
Index: []

In [42]:
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [43]:
#import pandas as pd

In [44]:
data=[['abc',1],['def',2],['ghi',3],['','hij'],['klm','a']]

In [45]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['', 'hij'], ['klm', 'a']]

In [46]:
d1=pd.DataFrame(data)

In [47]:
d1

     0    1
0  abc    1
1  def    2
2  ghi    3
3       hij
4  klm    a

In [48]:
#d=pd.DataFrame(data,columns=['A','B','C','D','E']) ## chnaging the column

In [49]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [50]:
d

     A    B
A  abc    1
B  def    2
C  ghi    3
D       hij
E  klm    a

In [51]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [52]:
data

{'name': ['a', 'b', 'c', 'd', 'e', 'f'], 'age': [45, 12, 48, 25, 12, 56]}

In [53]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [54]:
d.rename({'name':'Candidate','age':'Age_years'},axis=1,inplace=True)  ##change in origanal data when we use inplace

In [55]:
d

  Candidate  Age_years
0         a         45
1         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [56]:
d.rename({'Candidate':'Candidate112','Age_years':'Age_years112'},axis=1,inplace=True)

In [57]:
d

  Candidate112  Age_years112
0            a            45
1            b            12
2            c            48
3            d            25
4            e            12
5            f            56

In [58]:
d

  Candidate112  Age_years112
0            a            45
1            b            12
2            c            48
3            d            25
4            e            12
5            f            56

In [59]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [60]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [61]:
data[2][0]

'Kelly'

In [62]:
data[2][0]='asdf'

In [63]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['asdf', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [64]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['asdf', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [65]:
import pandas as pd

In [66]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [67]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [68]:
d[1,1]

KeyError: (1, 1)

In [69]:
d.Name

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [70]:
## accessing one single column
d['Name']

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [71]:
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2   asdf      Eco
3  Boris      Geo
4    Ken  English

In [72]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [73]:
d.iloc[1,1]

12

In [74]:
#d[0,0]

In [75]:
d.iloc[0,0] ="ALEX"  # changing an element

In [76]:
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [77]:
d['Gender'] = "Male"  # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALEX   10    Maths   Male
1    Bob   12  Science   Male
2   asdf   15      Eco   Male
3  Boris   14      Geo   Male
4    Ken   18  English   Male

In [78]:
d['Age'] = d['Age'] - 1   # d['Age']-=1

In [79]:
d

    Name  Age  Subject Gender
0   ALEX    9    Maths   Male
1    Bob   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [80]:
d.iloc[:,[0,1]] # Index location

    Name  Age
0   ALEX    9
1    Bob   11
2   asdf   14
3  Boris   13
4    Ken   17

In [81]:
d.iloc[[0,2],[0,1]]  # [row,col]

   Name  Age
0  ALEX    9
2  asdf   14

In [82]:
d.iloc[1:3,[0,1]]

   Name  Age
1   Bob   11
2  asdf   14

In [83]:
d.iloc[1:4,0:1]    ###

    Name
1    Bob
2   asdf
3  Boris

In [84]:
d.iloc[1]  # access row 1

Name           Bob
Age             11
Subject    Science
Gender        Male
Name: 1, dtype: object

In [85]:
pwd

'C:\\Users\\hp\\Documents\\python programs'

In [86]:
d

    Name  Age  Subject Gender
0   ALEX    9    Maths   Male
1    Bob   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [87]:
## to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

'Maths'

loc used for locating with column names

In [88]:
## loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

   Name  Subject
0  ALEX    Maths
1   Bob  Science
2  asdf      Eco

In [89]:
# Modify multiple values
d.iloc[:2,0]= ['abc','xyz']

In [90]:
d

    Name  Age  Subject Gender
0    abc    9    Maths   Male
1    xyz   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [91]:
d.loc[:,1]

KeyError: 1

In [92]:
# loc is typically used for accessing columns.

In [93]:
d

    Name  Age  Subject Gender
0    abc    9    Maths   Male
1    xyz   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [94]:
d['Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [95]:
d.loc[:,'Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [96]:
d

    Name  Age  Subject Gender
0    abc    9    Maths   Male
1    xyz   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [97]:
d.loc[3] ## getting the rows with singular index value

Name       Boris
Age           13
Subject      Geo
Gender      Male
Name: 3, dtype: object

In [98]:
d.iloc[:,[1,2]]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco
3   13      Geo
4   17  English

In [99]:
d.iloc[:3,1:3]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco